# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [3]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [8]:
# random int, range(1, 5), length 100
data1 = np.random.randint(1, 5, size = 100)

# random int, range(1, 4), length 100
data2 = np.random.randint(1, 4, size = 100)

# random int, range(10000, 30001), length 100
data3 = np.random.randint(10000, 30001, size = 100)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [19]:
## solution 1, using dictionary
data_dic = {"data1": data1, 
            "data2": data2, 
            "data3": data3}
pd.DataFrame(data_dic)

    data1  data2  data3
0       4      2  15240
1       1      3  27780
2       3      1  11439
3       3      1  14678
4       3      3  25169
..    ...    ...    ...
95      1      3  27985
96      2      2  24438
97      2      2  27041
98      4      3  17229
99      3      3  25513

[100 rows x 3 columns]

In [29]:
# solution 2, pd.concact 
# convert np arrays to pd series so that concat can work
data1 = pd.Series(data1)
data2 = pd.Series(data2)
data3 = pd.Series(data3)

df = pd.concat([data1, data2, data3], axis = 1, keys = ("data1", "data2", "data3"))
df

    data1  data2  data3
0       4      2  15240
1       1      3  27780
2       3      1  11439
3       3      1  14678
4       3      3  25169
..    ...    ...    ...
95      1      3  27985
96      2      2  24438
97      2      2  27041
98      4      3  17229
99      3      3  25513

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [35]:
# old column name : new column name
df = df.rename(columns = {"data1":"bedrs", "data2":"bathrs", "data3":"price_sqr_meter"})
df

    bedrs  bathrs  price_sqr_meter
0       4       2            15240
1       1       3            27780
2       3       1            11439
3       3       1            14678
4       3       3            25169
..    ...     ...              ...
95      1       3            27985
96      2       2            24438
97      2       2            27041
98      4       3            17229
99      3       3            25513

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [45]:
bigcolumn = pd.concat([data1, data2, data3])
bigcolumn

0         4
1         1
2         3
3         3
4         3
      ...
95    27985
96    24438
97    27041
98    17229
99    25513
Length: 300, dtype: int64

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [42]:
bigcolumn.shape
# no, it has 300 rows, therefor 300 indexes

(300,)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [46]:
# solution 1, redo concat
bigcolumn = pd.concat([data1, data2, data3])
bigcolumn = pd.concat([data1, data2, data3], ignore_index = True)
bigcolumn

0          4
1          1
2          3
3          3
4          3
       ...
295    27985
296    24438
297    27041
298    17229
299    25513
Length: 300, dtype: int64

In [50]:
# solution 2, dataframe.reset_index()
bigcolumn = pd.concat([data1, data2, data3])
bigcolumn.reset_index(drop = True, inplace = True)
bigcolumn

0          4
1          1
2          3
3          3
4          3
       ...
295    27985
296    24438
297    27041
298    17229
299    25513
Length: 300, dtype: int64